docs/equations.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-25 Sun 20:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>free42 equations</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mitch Richling" />
<meta name="description" content="Description of some free42/hp-42s/DM42 equations"
 />













</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://richmit.github.io/hp42/"> UP </a>
 |
 <a accesskey="H" href="https://www.mitchr.me/"> HOME </a>
</div><div id="content">
<h1 class="title">free42 equations</h1>
<table border="2 solid #ccc" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right"><b>Author:</b></td>
<td class="org-left"><i>Mitch Richling</i></td>
</tr>

<tr>
<td class="org-right"><b>Updated:</b></td>
<td class="org-left"><i>2021-04-23 23:51:40</i></td>
</tr>
</tbody>
</table>
<p align="center">
Copyright 2021 Mitch Richling. All rights reserved.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge3fe366">1. Metadata</a></li>
<li><a href="#org164a203">2. Introduction</a></li>
<li><a href="#org5db6c90">3. Master Program Label</a></li>
<li><a href="#org8fa31f8">4. Equations</a>
<ul>
<li><a href="#org1c10c9b">4.1. <code>KEPLE</code>: Kepler's Equation</a></li>
<li><a href="#orge313506">4.2. <code>KIUS</code>: Kiusalas Perfs</a></li>
<li><a href="#orga646085">4.3. <code>TVM</code>: Time Value of Money Equation</a></li>
<li><a href="#org21c2fd8">4.4. <code>EULI</code>:Euler Integral</a></li>
<li><a href="#org49ced1f">4.5. <code>NORMD</code>: Normal Distribution PDF</a></li>
<li><a href="#orgfa122c3">4.6. <code>FDIST</code>: F Distribution PDF</a></li>
<li><a href="#orgb13a8a1">4.7. <code>CHI2</code>: Chi Square Distribution PDF</a></li>
<li><a href="#org55c2c35">4.8. <code>BETAF</code>: Beta Distribution PDF</a></li>
<li><a href="#orge5274ea">4.9. <code>LOGID</code>: Logistic Distribution PDF</a></li>
<li><a href="#org9b65549">4.10. <code>STUTD</code>: Student's t Distribution PDF</a></li>
<li><a href="#orgdd78097">4.11. <code>WEIBD</code>: Weibull Distribution PDF</a></li>
<li><a href="#org8aa2cfa">4.12. <code>EXPOD</code>: Exponential Distribution PDF</a></li>
</ul>
</li>
<li><a href="#org9de502f">5. Master Program END</a></li>
<li><a href="#orgfeaebc5">6. EOF</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge3fe366" class="outline-2">
<h2 id="orge3fe366"><span class="section-number-2">1</span> Metadata</h2>
<div class="outline-text-2" id="text-1">
<p>
The home for this HTML file is: <a href="https://richmit.github.io/hp42/equations.html">https://richmit.github.io/hp42/equations.html</a>
</p>

<p>
Files related to this document may be found on github: <a href="https://github.com/richmit/hp42">https://github.com/richmit/hp42</a>
</p>

<p>
Directory contents:
</p>
<table border="0" cellspacing="0" cellpadding="6" rules="none" frame="none" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>src</code></td>
<td class="org-left">-</td>
<td class="org-left">The org-mode file that generated this HTML document</td>
</tr>

<tr>
<td class="org-left"><code>src_42s</code></td>
<td class="org-left">-</td>
<td class="org-left">Ready to convert source listings for 42s code in this document</td>
</tr>

<tr>
<td class="org-left"><code>docs</code></td>
<td class="org-left">-</td>
<td class="org-left">This html document</td>
</tr>

<tr>
<td class="org-left"><code>bin</code></td>
<td class="org-left">-</td>
<td class="org-left">Importable RAW program files</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org164a203" class="outline-2">
<h2 id="org164a203"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
<p>
Here we have a few handy equations.  All of them have MVAR declarations so they work with the 42s' integrator and solver.
</p>

<p>
Note that this is one "program" containing "sub-programs" with global labels.  Why not just let each equation be an individual program?  RAM!  The DM42 chews
up about half a kilobyte per program, and by combining them all into one program we save a ton of space.  Note that if <code>CLP</code> is used on <b>any</b> of the global
labels, then all of the equations are deleted (i.e. the entire program is zapped).  That is a feature!  It makes it easy to delete all the equations at one
time so they can all be reloaded when the Git repo is updated.
</p>
</div>
</div>

<div id="outline-container-org5db6c90" class="outline-2">
<h2 id="org5db6c90"><span class="section-number-2">3</span> Master Program Label</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-MEQNS" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (MEQNS)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Container Program for Equations</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-18</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"MEQNS"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8fa31f8" class="outline-2">
<h2 id="org8fa31f8"><span class="section-number-2">4</span> Equations</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org1c10c9b" class="outline-3">
<h3 id="org1c10c9b"><span class="section-number-3">4.1</span> <code>KEPLE</code>: Kepler's Equation</h3>
<div class="outline-text-3" id="text-4-1">
<p>
\[E_A - E \sin(E_A) - M_A = 0\]
</p>

<p>
\(M_A\) is the mean anomaly, and is represented by "<code>MA</code>" in the program.  \(E_A\) is the eccentric anomaly, and is represented by "<code>EA</code>" in the program.  \(E\) is
the eccentricity.
</p>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-KEPLE" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (KEPLE)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: MVAR Kepler's Equation</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-05</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"KEPLE"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"MA"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"EA"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"M"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"EA"</span>
<span style="color: #00ffff;">SIN</span>
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"E"</span>
<span style="color: #00ffff;">+/-</span>
<span style="color: #00ffff;">RCL+</span> <span style="color: #fa8072;">"EA"</span>
<span style="color: #00ffff;">RCL-</span> <span style="color: #fa8072;">"MA"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">END</span>
</pre>
</div>
</div>
</div>
