src/equations.org
** =KIUS=: Kiusalas Perfs

$$\frac{100000}{127 K}-P = 0$$

#+begin_src hp42s :eval never :tangle ../src_42s/equations/equations.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:KIUS)
@@@@ DSC: MVAR Kiusalas Perferations vs Standard Perferations
@@@@ UPD: 2021-04-05
LBL "KIUS"
MVAR "P"
MVAR "K"
100000
RCL× "K"
127
÷
RCL- "P"
RTN
@@@@ END
#+END_SRC

** =TVM=: Time Value of Money Equation

Can be used to solve TVM problems when solved.

$$PV+(1 + ip)\cdot PMT\cdot \frac{1-(1+i)^{-N}}{i}+FV\cdot (1+i)^{-N}$$

In the program we use "=B1/E0=" for the variable $p$.

#+begin_src hp42s :eval never :tangle ../src_42s/equations/equations.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:TVM)
@@@@ DSC: MVAR Time Value of Money Equation
@@@@ UPD: 2021-04-05
LBL "TVM"
MVAR "N"
MVAR "I"
MVAR "PV"
MVAR "PMT"
MVAR "FV"
MVAR "B1/E0"
1
ENTER
ENTER
RCL "I"
%
STO ST T
RCL× "B1/E0"
+
R↓
+
RCL "N"
+/-
Y↑X
1
X<>Y
-
LASTX
RCL× "FV"
R↓
X<>Y
÷
×
RCL× "PMT"
+
RCL+ "PV"
@@@@ END
#+END_SRC

** =EULI=:Euler Integral

Can be used to directly compute the incomplete beta function when integrated.

Related to the beta function, F distribution, and z distributions.

$$(x-1)(1-t)^{y-1}$$

#+begin_src hp42s :eval never :tangle ../src_42s/equations/equations.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:EULI)
@@@@ DSC: MVAR Euler Integral
@@@@ UPD: 2021-04-05
LBL "EULI"
MVAR "T"
MVAR "Y"
MVAR "X"
RCL "T"
RCL  "X"
1
-
Y↑X
1
RCL- "T"
RCL "Y"
1
-
Y↑X
×
RTN
@@@@ END
#+END_SRC

** =NORMD=: Normal Distribution PDF

Can be used to compute normal probabilities when integrated.

Related to the err function.

$$\frac{1}{s\sqrt{2\pi}}e^{-\frac{1}{2}\left(\frac{x-m}{s}\right)^2}$$

In most sources $\sigma$ is used instead of $s$ and $\mu$ is used instead of $m$.

#+begin_src hp42s :eval never :tangle ../src_42s/equations/equations.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:NORMD)
@@@@ DSC: MVAR Normal Distribution PDF
@@@@ UPD: 2021-04-05
LBL "NORMD"
MVAR "S"
MVAR "M"
MVAR "X"
RCL "X"
RCL- "M"
RCL÷ "S"
X↑2
-2
÷
E↑X
RCL÷ "S"
2
PI
×
SQRT
÷
RTN
@@@@ END
#+END_SRC

** =FDIST=: F Distribution PDF

Can be used to compute F probabilities when integrated.

$$\frac{\sqrt{\frac{(d_1x)^{d_1}d_2^{d_2}}{(d_1x+d_2)^{d_1+d_2}}}}{x\mathrm{B}\left(\frac{d_1}{2},\frac{d_2}{2}\right)}$$

#+begin_src hp42s :eval never :tangle ../src_42s/equations/equations.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:FDIST)
@@@@ DSC: MVAR F Distribution PDF
@@@@ UPD: 2021-04-05
LBL "FDIST"
MVAR "D1"
MVAR "D2"
MVAR "X"
RCL "D1"
2
÷
RCL "D2"
2
÷
XEQ "BETA"
RCL× "X"
RCL "D1"
RCL× "X"
RCL "D1"
Y↑X
RCL "D2"
RCL "D2"
Y↑X
×
RCL "D1"
RCL× "X"
RCL+ "D2"
RCL "D1"
RCL+ "D2"
Y↑X
÷
SQRT
X<>Y
÷
RTN
@@@@ END
#+END_SRC

