docs/equations.html

<div id="outline-container-orge313506" class="outline-3">
<h3 id="orge313506"><span class="section-number-3">4.2</span> <code>KIUS</code>: Kiusalas Perfs</h3>
<div class="outline-text-3" id="text-4-2">
<p>
\[\frac{100000}{127 K}-P = 0\]
</p>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-KIUS" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (KIUS)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: MVAR Kiusalas Perferations vs Standard Perferations</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-05</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"KIUS"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"P"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"K"</span>
100000
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"K"</span>
127
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RCL-</span> <span style="color: #fa8072;">"P"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">END</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga646085" class="outline-3">
<h3 id="orga646085"><span class="section-number-3">4.3</span> <code>TVM</code>: Time Value of Money Equation</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Can be used to solve TVM problems when solved.
</p>

<p>
\[PV+(1 + ip)\cdot PMT\cdot \frac{1-(1+i)^{-N}}{i}+FV\cdot (1+i)^{-N}\]
</p>

<p>
In the program we use "<code>B1/E0</code>" for the variable \(p\).
</p>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-TVM" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (TVM)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: MVAR Time Value of Money Equation</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-05</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"TVM"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"N"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"I"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"PV"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"PMT"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"FV"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"B1/E0"</span>
1
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"I"</span>
<span style="color: #00ffff;">%</span>
<span style="color: #00ffff;">STO ST</span> T
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"B1/E0"</span>
<span style="color: #00ffff;">+</span>
R&#8595;
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"N"</span>
<span style="color: #00ffff;">+/-</span>
<span style="color: #00ffff;">Y&#8593;X</span>
1
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">LASTX</span>
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"FV"</span>
R&#8595;
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"PMT"</span>
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">RCL+</span> <span style="color: #fa8072;">"PV"</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">END</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org21c2fd8" class="outline-3">
<h3 id="org21c2fd8"><span class="section-number-3">4.4</span> <code>EULI</code>:Euler Integral</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Can be used to directly compute the incomplete beta function when integrated.
</p>

<p>
Related to the beta function, F distribution, and z distributions.
</p>

<p>
\[(x-1)(1-t)^{y-1}\]
</p>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-EULI" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (EULI)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: MVAR Euler Integral</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-05</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"EULI"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"T"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"Y"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"T"</span>
<span style="color: #00ffff;">RCL</span>  <span style="color: #fa8072;">"X"</span>
1
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">Y&#8593;X</span>
1
<span style="color: #00ffff;">RCL-</span> <span style="color: #fa8072;">"T"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"Y"</span>
1
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">Y&#8593;X</span>
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">END</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org49ced1f" class="outline-3">
<h3 id="org49ced1f"><span class="section-number-3">4.5</span> <code>NORMD</code>: Normal Distribution PDF</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Can be used to compute normal probabilities when integrated.
</p>

<p>
Related to the err function.
</p>

<p>
\[\frac{1}{s\sqrt{2\pi}}e^{-\frac{1}{2}\left(\frac{x-m}{s}\right)^2}\]
</p>

<p>
In most sources \(\sigma\) is used instead of \(s\) and \(\mu\) is used instead of \(m\).
</p>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-NORMD" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (NORMD)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: MVAR Normal Distribution PDF</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-05</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"NORMD"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"S"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"M"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL-</span> <span style="color: #fa8072;">"M"</span>
<span style="color: #00ffff;">RCL&#247;</span> <span style="color: #fa8072;">"S"</span>
<span style="color: #00ffff;">X&#8593;2</span>
-2
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">E&#8593;X</span>
<span style="color: #00ffff;">RCL&#247;</span> <span style="color: #fa8072;">"S"</span>
2
<span style="color: #00ffff;">PI</span>
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">SQRT</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">END</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfa122c3" class="outline-3">
<h3 id="orgfa122c3"><span class="section-number-3">4.6</span> <code>FDIST</code>: F Distribution PDF</h3>
<div class="outline-text-3" id="text-4-6">
<p>
Can be used to compute F probabilities when integrated.
</p>

<p>
\[\frac{\sqrt{\frac{(d_1x)^{d_1}d_2^{d_2}}{(d_1x+d_2)^{d_1+d_2}}}}{x\mathrm{B}\left(\frac{d_1}{2},\frac{d_2}{2}\right)}\]
</p>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-FDIST" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (FDIST)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: MVAR F Distribution PDF</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-05</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"FDIST"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"D1"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"D2"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"D1"</span>
2
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"D2"</span>
2
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"BETA"</span>
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"D1"</span>
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"D1"</span>
<span style="color: #00ffff;">Y&#8593;X</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"D2"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"D2"</span>
<span style="color: #00ffff;">Y&#8593;X</span>
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"D1"</span>
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL+</span> <span style="color: #fa8072;">"D2"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"D1"</span>
<span style="color: #00ffff;">RCL+</span> <span style="color: #fa8072;">"D2"</span>
<span style="color: #00ffff;">Y&#8593;X</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">SQRT</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">END</span>
</pre>
</div>
</div>
</div>
