src/equations.org
** =CHI2=: Chi Square Distribution PDF

Can be used to compute chi square probabilities when integrated.

$$\frac{x^{\frac{k}{2}-1}e^{-\frac{x}{2}}}{2^{\frac{k}{2}}\Gamma\left(\frac{k}{2}\right)}$$

#+begin_src hp42s :eval never :tangle ../src_42s/equations/equations.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:CHI2)
@@@@ DSC: MVAR Chi Square Distribution PDF
@@@@ UPD: 2021-04-05
LBL "CHI2"
MVAR "K"
MVAR "X"
RCL "K"
2
÷
ENTER
ENTER
1
-
RCL "X"
X<>Y
Y↑X
RCL "X"
-2
÷
E↑X
×
2
RCL ST Z
Y↑X
÷
X<>Y
GAMMA
÷
RTN
@@@@ END
#+END_SRC

** =BETAF=: Beta Distribution PDF

Can be used to compute beta probabilities when integrated.

$$\frac{x^{a-1}(1-x)^{b-1}}{\mathrm{B}(a,b)}$$

In most sources $\alpha$ is used instead of $a$ and $\beta$ is used instead of $b$.

#+begin_src hp42s :eval never :tangle ../src_42s/equations/equations.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:BETAF)
@@@@ DSC: MVAR Beta Distribution PDF
@@@@ UPD: 2021-04-05
LBL "BETAF"
MVAR "A"
MVAR "B"
MVAR "X"
RCL "A"
RCL "B"
XEQ "BETA"
RCL "X"
-1
RCL+ "A"
Y↑X
X<>Y
÷
1
RCL "X"
-
RCL "B"
1
-
Y↑X
×
RTN
@@@@ END
#+END_SRC

** =LOGID=: Logistic Distribution PDF

Can be used to compute logistic probabilities when integrated.

$$\frac{1}{4s}\mathrm{sech}\left(\frac{x-m}{2s}\right)$$

Note $s$ is sometimes called the "scale parameter", and $m$ is sometimes called the "location parameter".

Also note that various symbols are used for the parameters -- $\mu$ & $\sigma$ for example.

#+begin_src hp42s :eval never :tangle ../src_42s/equations/equations.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:LOGID)
@@@@ DSC: MVAR Logistic Distribution PDF
@@@@ UPD: 2021-04-05
LBL "LOGID"
MVAR "S"
MVAR "M"
MVAR "X"
RCL "M"
RCL- "X"
RCL÷ "S"
E↑X
ENTER
ENTER
1
+
X↑2
÷
RCL÷ "S"
RTN
@@@@ END
#+END_SRC

** =STUTD=: Student's t Distribution PDF

Can be used to compute Student's t probabilities when integrated.

$$\frac{1}{\sqrt{\nu}\cdot\mathrm{B}\left(\frac{1}{2},\frac{\nu}{2}\right)}\left(1+\frac{x^2}{\nu}\right)^{-\frac{\nu+1}{2}}$$

In the program "=V=" is used for $\nu$.

#+begin_src hp42s :eval never :tangle ../src_42s/equations/equations.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:STUTD)
@@@@ DSC: MVAR Student's t Distribution PDF
@@@@ UPD: 2021-04-05
LBL "STUTD"
MVAR "V"
MVAR "X"
0.5
RCL "V"
2
÷
XEQ "BETA"
RCL "V"
SQRT
×
1
RCL "X"
X↑2
RCL÷ "V"
+
1
RCL+ "V"
-2
÷
Y↑X
X<>Y
÷
RTN
@@@@ END
#+END_SRC

** =WEIBD=: Weibull Distribution PDF

Can be used to compute Weibull probabilities when integrated.

$$\frac{k}{\lambda}\left(\frac{x}{\lambda}\right)^{k-1}e^{-\left(\frac{x}{\lambda}\right)^k}$$

In the program below we use "=L=" for $\lambda$.

Note that some sources use $\frac{1}{\lambda}$ as the parameter instead of $\lambda$.

#+begin_src hp42s :eval never :tangle ../src_42s/equations/equations.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:WEIBD)
@@@@ DSC: MVAR Weibull Distribution PDF
@@@@ UPD: 2021-04-05
LBL "WEIBD"
MVAR "K"
MVAR "L"
MVAR "X"
RCL "K"
RCL÷ "L"
RCL "X"
RCL÷ "L"
-1
RCL+ "K"
Y↑X
×
RCL "X"
RCL÷ "L"
RCL "K"
Y↑X
+/-
E↑X
×
RTN
@@@@ END
#+END_SRC

