docs/equations.html

<div id="outline-container-orgb13a8a1" class="outline-3">
<h3 id="orgb13a8a1"><span class="section-number-3">4.7</span> <code>CHI2</code>: Chi Square Distribution PDF</h3>
<div class="outline-text-3" id="text-4-7">
<p>
Can be used to compute chi square probabilities when integrated.
</p>

<p>
\[\frac{x^{\frac{k}{2}-1}e^{-\frac{x}{2}}}{2^{\frac{k}{2}}\Gamma\left(\frac{k}{2}\right)}\]
</p>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-CHI2" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (CHI2)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: MVAR Chi Square Distribution PDF</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-05</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"CHI2"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"K"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"K"</span>
2
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">ENTER</span>
1
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">Y&#8593;X</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
-2
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">E&#8593;X</span>
<span style="color: #00ffff;">&#215;</span>
2
<span style="color: #00ffff;">RCL ST</span> Z
<span style="color: #00ffff;">Y&#8593;X</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">GAMMA</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">END</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org55c2c35" class="outline-3">
<h3 id="org55c2c35"><span class="section-number-3">4.8</span> <code>BETAF</code>: Beta Distribution PDF</h3>
<div class="outline-text-3" id="text-4-8">
<p>
Can be used to compute beta probabilities when integrated.
</p>

<p>
\[\frac{x^{a-1}(1-x)^{b-1}}{\mathrm{B}(a,b)}\]
</p>

<p>
In most sources \(\alpha\) is used instead of \(a\) and \(\beta\) is used instead of \(b\).
</p>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-BETAF" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (BETAF)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: MVAR Beta Distribution PDF</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-05</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"BETAF"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"A"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"B"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"A"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"B"</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"BETA"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
-1
<span style="color: #00ffff;">RCL+</span> <span style="color: #fa8072;">"A"</span>
<span style="color: #00ffff;">Y&#8593;X</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">&#247;</span>
1
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"B"</span>
1
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">Y&#8593;X</span>
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">END</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge5274ea" class="outline-3">
<h3 id="orge5274ea"><span class="section-number-3">4.9</span> <code>LOGID</code>: Logistic Distribution PDF</h3>
<div class="outline-text-3" id="text-4-9">
<p>
Can be used to compute logistic probabilities when integrated.
</p>

<p>
\[\frac{1}{4s}\mathrm{sech}\left(\frac{x-m}{2s}\right)\]
</p>

<p>
Note \(s\) is sometimes called the "scale parameter", and \(m\) is sometimes called the "location parameter".
</p>

<p>
Also note that various symbols are used for the parameters &#x2013; \(\mu\) &amp; \(\sigma\) for example.
</p>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-LOGID" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (LOGID)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: MVAR Logistic Distribution PDF</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-05</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"LOGID"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"S"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"M"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"M"</span>
<span style="color: #00ffff;">RCL-</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL&#247;</span> <span style="color: #fa8072;">"S"</span>
<span style="color: #00ffff;">E&#8593;X</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">ENTER</span>
1
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">X&#8593;2</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RCL&#247;</span> <span style="color: #fa8072;">"S"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">END</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9b65549" class="outline-3">
<h3 id="org9b65549"><span class="section-number-3">4.10</span> <code>STUTD</code>: Student's t Distribution PDF</h3>
<div class="outline-text-3" id="text-4-10">
<p>
Can be used to compute Student's t probabilities when integrated.
</p>

<p>
\[\frac{1}{\sqrt{\nu}\cdot\mathrm{B}\left(\frac{1}{2},\frac{\nu}{2}\right)}\left(1+\frac{x^2}{\nu}\right)^{-\frac{\nu+1}{2}}\]
</p>

<p>
In the program "<code>V</code>" is used for \(\nu\).
</p>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-STUTD" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (STUTD)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: MVAR Student's t Distribution PDF</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-05</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"STUTD"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"V"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"X"</span>
0.5
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"V"</span>
2
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"BETA"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"V"</span>
<span style="color: #00ffff;">SQRT</span>
<span style="color: #00ffff;">&#215;</span>
1
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">X&#8593;2</span>
<span style="color: #00ffff;">RCL&#247;</span> <span style="color: #fa8072;">"V"</span>
<span style="color: #00ffff;">+</span>
1
<span style="color: #00ffff;">RCL+</span> <span style="color: #fa8072;">"V"</span>
-2
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">Y&#8593;X</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">END</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdd78097" class="outline-3">
<h3 id="orgdd78097"><span class="section-number-3">4.11</span> <code>WEIBD</code>: Weibull Distribution PDF</h3>
<div class="outline-text-3" id="text-4-11">
<p>
Can be used to compute Weibull probabilities when integrated.
</p>

<p>
\[\frac{k}{\lambda}\left(\frac{x}{\lambda}\right)^{k-1}e^{-\left(\frac{x}{\lambda}\right)^k}\]
</p>

<p>
In the program below we use "<code>L</code>" for \(\lambda\).
</p>

<p>
Note that some sources use \(\frac{1}{\lambda}\) as the parameter instead of \(\lambda\).
</p>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-WEIBD" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (WEIBD)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: MVAR Weibull Distribution PDF</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-05</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"WEIBD"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"K"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"L"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"K"</span>
<span style="color: #00ffff;">RCL&#247;</span> <span style="color: #fa8072;">"L"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL&#247;</span> <span style="color: #fa8072;">"L"</span>
-1
<span style="color: #00ffff;">RCL+</span> <span style="color: #fa8072;">"K"</span>
<span style="color: #00ffff;">Y&#8593;X</span>
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL&#247;</span> <span style="color: #fa8072;">"L"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"K"</span>
<span style="color: #00ffff;">Y&#8593;X</span>
<span style="color: #00ffff;">+/-</span>
<span style="color: #00ffff;">E&#8593;X</span>
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">END</span>
</pre>
</div>
</div>
</div>
